Revit 2027 API
FilterDialog.NewFilterName Property
 The name of the new ParameterFilterElement to be created and selected once Show is invoked.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string NewFilterName { get; set; }
Public Property NewFilterName As String
	Get
	Set
public:
property String^ NewFilterName {
	String^ get ();
	void set (String^ value);
}
member NewFilterName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: newFilterName is an empty string. -or- When setting this property: newFilterName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- When setting this property: The supplied filter name newFilterName is not unique.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FilterDialog Class
Autodesk.Revit.UI Namespace